env.org
#+AUTHOR: Yuuhi
#+TITLE: 環境設定のこと
#+LANGUAGE: ja
#+HTML: <meta content='no-cache' http-equiv='Pragma' />

#+STYLE: <link rel="stylesheet" type="text/css" href="./bootstrap.min.css">
#+STYLE: <link rel="stylesheet" type="text/css" href="./org-mode.css">

#+begin_html
    <div class='navbar navbar-fixed-top'>
      <div class='navbar-inner'>
        <div class='container'>
          <a class='brand' href='/memo/index.html'>トップに戻る</a>
          <ul class='nav'>
            <li>
              <a href='#sec-1'>Mac</a>
            </li>
            <li>
              <a href='#sec-2'>Linux</a>
            </li>
            <li>
              <a href='#sec-3'>Windows</a>
            </li>
          </ul>
        </div>
      </div>
    </div>
#+end_html

* Mac OSX Lion

* Linux
** OpenSUSE
** Debian
** Linux Mint
*** URL
http://linuxmint.com/
*** さっき知った思ったより良さそう
- Debianベースがあるそうなので入れてみる

** インストールした
- とりあえず日本語で
  - aptitudeは最初から入っていた
  - zsh, tmux, emacs, vimのインストール
    #+begin_example
    $ chsh -s /usr/bin/zsh
    #+end_example
  - ibus-mozcのインストール
    #+begin_example
     % sudo aptitude install ibus-mozc
     % sudo aptitude install im-switch
     % im-switch -s ibus
    #+end_example
    その後ここにあるように設定して，再起動する．\\
   http://tsuzuki-kun.com/joomla/index.php?option=com_content&view=article&id=205&Itemid=221

    - .zshrcにこれを追加
      #+begin_example
      export GTK_IM_MODULE=ibus
      export XMODIFIERS=@im=ibus
      export QT_IM_MODULE=ibus
      #+end_example

  - Dropboxのインストール https://www.dropbox.com/
    #+begin_example
    % sudo dpkg -i hoge.deb
    % dropbox start -i
    #+end_example
  - Gitのインストール
    #+begin_example
    % sudo aptitue install git-core
    #+end_example

  - Curl, sqlite3
    curlは最初からあった？
    #+begin_example
    % sudo aptitue install sqlite3
    #+end_example

  - sshサーバ起動
    #+begin_example
    % sudo aptitude install openssh-server
    % /etc/init.d/ssh start # 必要ないかも
    #+end_example
    
  - Rubyの環境整備
    - 最初からRuby1.8は入っていた
    - RVM導入
      https://rvm.io/rvm/install/
    #+begin_example
    % curl -L get.rvm.io | bash -s stable
    % source ~/.rvm/scripts/rvm
    % rvm requirements
    % rvm install 1.9.3
    % rvm use 1.9.3 --default
    #+end_example

    - gemが最初から入っていた
      - gem installしようとすると怒られる
        #+begin_example
	% gem install twitter
	ERROR:  Loading command: install (LoadError)
	cannot load such file -- zlib
	ERROR:  While executing gem ... (NameError)
	uninitialized constant Gem::Commands::InstallCommand
	#+end_example

	zlib1g-devをインストールすれば良い

        #+begin_example
	% sudo aptitude install zlib1g-dev
	% cd  ~/.rvm/src/ruby-1.9.3-p194/ext/zlib
	% ruby extconf.rb
	$ make
	$ make install
        #+end_example

        #+begin_example
	% gem install twitter oauth
        #+end_example

  - MySQLのインストール
    #+begin_example
    % sudo aptitude install mysql-server
    % mysql -u root -p
    #+end_example

    - Rubyで使うために
    #+begin_example
    % sudo aptitude install libmysqld-dev
    % gem install mysql
    #+end_example
    
  - mecab
    #+begin_example
    % wget http://mecab.googlecode.com/files/mecab-0.993.tar.gz
    ...
    % ./configure --with-charset=utf8 --enable-utf8-only  # UTF-8だけ
    % make
    % sudo make install
    % sudo ldconfig # これがないと反映されない？
    #+end_example

    辞書も
    #+begin_example
    % wget http://mecab.googlecode.com/files/mecab-ipadic-2.7.0-20070801.tar.gz
    ..
    % ./configure --with-charset=utf8
    # あと同じ
    #+end_example

    - RubyでMecabを使うために
      #+begin_example
      % wget http://mecab.googlecode.com/files/mecab-ruby-0.993.tar.gz
      % tar xvzf mecab-ruby-0.993.tar.gz
      % cd mecab-ruby-0.993
      % ruby extconf.rb
      % make
      % make install
      % gem build mecab-ruby.gemspec
      % gem install mecab-ruby-0.99.gem
      % sudo ldconfig
      #+end_example

   - OpenSSL
     #+begin_example
     % sudo aptitude install libssl-dev
     % cd .rvm/src/ruby-1.9.3-p194/ext/openssl
     % ruby extconf.rb
     % make
     % make install
     #+end_example

** 結局またUbuntu使っている


* Windows

