env.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>環境設定のこと</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="環境設定のこと"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-05-03 07:22:56 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">環境設定のこと</h1>


<meta content='no-cache' http-equiv='Pragma' />


    <div class='navbar navbar-fixed-top'>
      <div class='navbar-inner'>
        <div class='container'>
          <a class='brand' href='/memo/index.html'>ねこねここねこ</a>
          <ul class='nav'>
            <li>
              <a href='#sec-1'>Mac</a>
            </li>
            <li>
              <a href='#sec-2'>Linux</a>
            </li>
            <li>
              <a href='#sec-3'>Windows</a>
            </li>
          </ul>
        </div>
      </div>
    </div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Mac OSX Lion</a></li>
<li><a href="#sec-2">2 Linux</a>
<ul>
<li><a href="#sec-2-1">2.1 OpenSUSE</a></li>
<li><a href="#sec-2-2">2.2 Debian</a></li>
<li><a href="#sec-2-3">2.3 Linux Mint</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1 URL</a></li>
<li><a href="#sec-2-3-2">2.3.2 さっき知った思ったより良さそう</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4 インストールした</a></li>
<li><a href="#sec-2-5">2.5 結局またUbuntu使っている</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Windows</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Mac OSX Lion</h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Linux</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> OpenSUSE</h3>
<div class="outline-text-3" id="text-2-1">

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Debian</h3>
<div class="outline-text-3" id="text-2-2">

</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Linux Mint</h3>
<div class="outline-text-3" id="text-2-3">


</div>

<div id="outline-container-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> URL</h4>
<div class="outline-text-4" id="text-2-3-1">

<p><a href="http://linuxmint.com/">http://linuxmint.com/</a>
</p></div>

</div>

<div id="outline-container-2-3-2" class="outline-4">
<h4 id="sec-2-3-2"><span class="section-number-4">2.3.2</span> さっき知った思ったより良さそう</h4>
<div class="outline-text-4" id="text-2-3-2">

<ul>
<li>Debianベースがあるそうなので入れてみる
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> インストールした</h3>
<div class="outline-text-3" id="text-2-4">

<ul>
<li>とりあえず日本語で
<ul>
<li>aptitudeは最初から入っていた
</li>
<li>zsh, tmux, emacs, vimのインストール



<pre class="example">$ chsh -s /usr/bin/zsh
</pre>

</li>
<li>ibus-mozcのインストール



<pre class="example">% sudo aptitude install ibus-mozc
% sudo aptitude install im-switch
% im-switch -s ibus
</pre>

<p>
    その後ここにあるように設定して，再起動する．<br/>
   <a href="http://tsuzuki-kun.com/joomla/index.php?option=com_content&amp;view=article&amp;id=205&amp;Itemid=221">http://tsuzuki-kun.com/joomla/index.php?option=com_content&amp;view=article&amp;id=205&amp;Itemid=221</a>
</p>
<ul>
<li>.zshrcにこれを追加



<pre class="example">export GTK_IM_MODULE=ibus
export XMODIFIERS=@im=ibus
export QT_IM_MODULE=ibus
</pre>


</li>
</ul>

</li>
<li>Dropboxのインストール <a href="https://www.dropbox.com/">https://www.dropbox.com/</a>



<pre class="example">% sudo dpkg -i hoge.deb
% dropbox start -i
</pre>

</li>
<li>Gitのインストール



<pre class="example">% sudo aptitue install git-core
</pre>


</li>
<li>Curl, sqlite3
    curlは最初からあった？



<pre class="example">% sudo aptitue install sqlite3
</pre>


</li>
<li>sshサーバ起動



<pre class="example">% sudo aptitude install openssh-server
% /etc/init.d/ssh start # 必要ないかも
</pre>


</li>
<li>Rubyの環境整備
<ul>
<li>最初からRuby1.8は入っていた
</li>
<li>RVM導入
      <a href="https://rvm.io/rvm/install/">https://rvm.io/rvm/install/</a>



<pre class="example">% curl -L get.rvm.io | bash -s stable
% source ~/.rvm/scripts/rvm
% rvm requirements
% rvm install 1.9.3
% rvm use 1.9.3 --default
</pre>


<ul>
<li>gemが最初から入っていた
<ul>
<li>gem installしようとすると怒られる



<pre class="example">% gem install twitter
ERROR:  Loading command: install (LoadError)
cannot load such file -- zlib
ERROR:  While executing gem ... (NameError)
uninitialized constant Gem::Commands::InstallCommand
</pre>


<p>
        zlib1g-devをインストールすれば良い
</p>



<pre class="example">% sudo aptitude install zlib1g-dev
% cd  ~/.rvm/src/ruby-1.9.3-p194/ext/zlib
% ruby extconf.rb
$ make
$ make install
</pre>



<pre class="example">% gem install twitter oauth
</pre>


</li>
</ul>

</li>
</ul>

</li>
<li>MySQLのインストール



<pre class="example">% sudo aptitude install mysql-server
% mysql -u root -p
</pre>


<ul>
<li>Rubyで使うために



<pre class="example">% sudo aptitude install libmysqld-dev
% gem install mysql
</pre>


</li>
<li>mecab



<pre class="example">% wget http://mecab.googlecode.com/files/mecab-0.993.tar.gz
...
% ./configure --with-charset=utf8 --enable-utf8-only  # UTF-8だけ
% make
% sudo make install
% sudo ldconfig # これがないと反映されない？
</pre>


<p>
    辞書も
</p>


<pre class="example">% wget http://mecab.googlecode.com/files/mecab-ipadic-2.7.0-20070801.tar.gz
..
% ./configure --with-charset=utf8
# あと同じ
</pre>


<ul>
<li>RubyでMecabを使うために



<pre class="example">% wget http://mecab.googlecode.com/files/mecab-ruby-0.993.tar.gz
% tar xvzf mecab-ruby-0.993.tar.gz
% cd mecab-ruby-0.993
% ruby extconf.rb
% make
% make install
% gem build mecab-ruby.gemspec
% gem install mecab-ruby-0.99.gem
% sudo ldconfig
</pre>


</li>
<li>OpenSSL



<pre class="example">% sudo aptitude install libssl-dev
% cd .rvm/src/ruby-1.9.3-p194/ext/openssl
% ruby extconf.rb
% make
% make install
</pre>

</li>
</ul>

</li>
</ul>

</li>
</ul>


</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 結局またUbuntu使っている</h3>
<div class="outline-text-3" id="text-2-5">



</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Windows</h2>
<div class="outline-text-2" id="text-3">


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-05-03 07:22:56 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
